In [1]:
import pandas as pd

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
pd.Series([4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
mylist = [x for x in range (1,150,15)]
pd.Series(mylist)

0      1
1     16
2     31
3     46
4     61
5     76
6     91
7    106
8    121
9    136
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data: (given in question) then print it.

In [4]:
my_dict = {"Name": ["Alice", "Bob", "Claire"], "Age": [25, 30, 27], "Gender": ["Female", "Male", "Female"]}
df = pd.DataFrame(my_dict)
print(df.to_string(index=False))

  Name  Age Gender
 Alice   25 Female
   Bob   30   Male
Claire   27 Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas Series? Explain with an example.

DataFrame is a representation of the tabular structure of data having a proper control on header and indexes. It is mostly two-dimensional. On the other hand, Series is one dimensional and having a single column of element (with index). We can consider each column of a DataFrame is Series. Below example will demonstrate it:

In [5]:
print(df)
print(type(df))
print("\n\n*************\n\n")
print(df.iloc[:,1])
print(type(df.iloc[:,1]))

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
<class 'pandas.core.frame.DataFrame'>


*************


0    25
1    30
2    27
Name: Age, dtype: int64
<class 'pandas.core.series.Series'>

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1. pd.read_csv(), pd.read_excel(), pd.read_html() etc..
2. df.head(), df.tail()
3. df.concat(), df.merge()
4. df.to_csv(), df.to_excel() etc<br>

Let's Use Concatenation function

In [6]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [7]:
df2 = pd.DataFrame({"Name": ["Souvik","Souvick","Asmita"], "Age": [27, 29,28], "Gender": ["Male", "Male", "Female"]})
df2

      Name  Age  Gender
0   Souvik   27    Male
1  Souvick   29    Male
2   Asmita   28  Female

In [8]:
df_new = pd.concat([df,df2],axis=0,ignore_index=True)
df_new

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2   Claire   27  Female
3   Souvik   27    Male
4  Souvick   29    Male
5   Asmita   28  Female

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [9]:
df_new.iloc[1,1] = 60
df_new

      Name  Age  Gender
0    Alice   25  Female
1      Bob   60    Male
2   Claire   27  Female
3   Souvik   27    Male
4  Souvick   29    Male
5   Asmita   28  Female

We can see that the DataFrame is definitely Mutable.

In [10]:
my_Series = df_new["Name"]
my_Series[4] = "Ranbir"

/tmp/ipykernel_3800/4192329037.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  my_Series[4] = "Ranbir"

Series is immutable!!!

Hey, Unfortunastely I'm not sure about Panel.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [11]:
name = pd.Series(["Anand", "Caruana", "Polgar", "Pragnananda", "Carlsen"])
Age = pd.Series([52,31,47,18,32])
Rating = pd.Series([2754, 2782, 2675, 2707, 2835])
Country = pd.Series(["India","USA","Hungary","India","Norway"])

In [15]:
Chess = pd.concat([name,Age,Rating,Country],axis=1)
Chess.columns = ["Name", "Age", "Rating", "Country"]
print(Chess)

          Name  Age  Rating  Country
0        Anand   52    2754    India
1      Caruana   31    2782      USA
2       Polgar   47    2675  Hungary
3  Pragnananda   18    2707    India
4      Carlsen   32    2835   Norway